Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes
Serialization structure for AnalysisPartAreaAttributes.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._AreaElementType
The area element type.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._AreaElementSizeX
The area element size X.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._AreaElementSizeY
The area element size Y.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._AreaElementSizeHoles
The area element size holes.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._AreaRotationXY
The area rotation XY.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._AreaSupportType
The area support type.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._AreaStartNumber
The start number of the area.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._UseSimpleArea
This indicates whether simple areas are being used.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._MinimumAreaHoleSize
The minimum area hole size.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes._RigidDiaphragmFilterName
The rigid diaphragm filter name.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes.ToStruct(Tekla.Structures.Analysis.AnalysisPartAreaAttributes)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.DotAnalysisPartAreaAttributes.FromStruct(Tekla.Structures.Analysis.AnalysisPartAreaAttributes)
DO NOT USE! For internal usage only!
P: P.